---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetallicpaintTopcoatType
source: html/36f13024-5f47-2de8-317a-b48da018f14d.htm
---
# Autodesk.Revit.DB.Visual.MetallicpaintTopcoatType

The enumerated type representing the permitted values for the asset property "MetallicpaintTopcoat" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public enum MetallicpaintTopcoatType
```